Documents/гф_СпецификацияПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_СпецификацияПокупателя</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказыКлиентов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/B2B_w_СкидкиКлиентаПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>B2B_w_СкидкиКлиентаПоДоговору</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСкидки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_w_ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_w_Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/гф_ГлобальныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>гф_ГлобальныеЗначения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеХЗ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Documents/гф_СпецификацияПокупателя/Forms/ПараметрыСпецификацииПоНовойЦене/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	гф_ГлобальныеЗначения.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.гф_ГлобальныеЗначения КАК гф_ГлобальныеЗначения
	|ГДЕ
	|	гф_ГлобальныеЗначения.Ключ = &Ключ"; 
	
	Ключ = "гф_ГлобальныеЗначенияОптоваяЗакупочнаяЦена";
	
	Запрос.Параметры.Вставить("Ключ", Ключ);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда  
		
		ОптоваяЦенаОбъект = ПланыВидовХарактеристик.гф_ГлобальныеЗначения.СоздатьЭлемент();
		
		ТипЦена = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");
		
		ОптоваяЦенаОбъект.Ключ			= Ключ;
		ОптоваяЦенаОбъект.Наименование	= "Тип цен оптовая";
		ОптоваяЦенаОбъект.ТипЗначения	= ТипЦена;
		ОптоваяЦенаОбъект.Родитель		= ПланыВидовХарактеристик.гф_ГлобальныеЗначения.ОбщегоНазначения;
		
		ОптоваяЦенаОбъект.Записать();
		
		ПрайсЛист = Неопределено;
		
	Иначе
		
		Выборка = Результат.Выбрать();  
		
		Выборка.Следующий();
		
		ПрайсЛист = Выборка.Значение;
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ПрайсЛист) Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено глобальное значение ""Тип цен оптовая"".");
		
	КонецЕсли;	  
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(B2B_w_СкидкиКлиентаПоДоговоруСрезПоследних.Скидка, 0)) КАК Скидка
	|ИЗ
	|	ПланВидовХарактеристик.гф_ГлобальныеЗначения КАК гф_ГлобальныеЗначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.гф_ГлобальныеЗначения.Список КАК гф_ГлобальныеЗначенияСписок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.B2B_w_СкидкиКлиентаПоДоговору.СрезПоследних(&ДатаСкидки, ДоговорКонтрагента = &Договор) КАК B2B_w_СкидкиКлиентаПоДоговоруСрезПоследних
	|			ПО гф_ГлобальныеЗначенияСписок.Значение = B2B_w_СкидкиКлиентаПоДоговоруСрезПоследних.ТипСкидки
	|		ПО гф_ГлобальныеЗначения.Ссылка = гф_ГлобальныеЗначенияСписок.Ссылка
	|ГДЕ
	|	гф_ГлобальныеЗначения.Ключ = &Ключ";
	
	
	Договор = Неопределено;
	
	Параметры.Свойство("Договор", Договор);
	
	Запрос.Параметры.Вставить("ДатаСкидки", ТекущаяДатаСеанса());
	Запрос.Параметры.Вставить("Ключ", "гф_ГлобальныеЗначенияСкидкиДляЗаказаКлиента");
	Запрос.Параметры.Вставить("Договор", Договор);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка= Результат.Выбрать();
		
		Выборка.Следующий();
		
		СкидкаКлиента = Выборка.Скидка;
		
	КонецЕсли;	

	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ПредоплатныйКлиентПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПредоплатныйКлиентПриИзмененииНаСервере()    
	
	Если ПредоплатныйКлиент Тогда   
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	гф_ГлобальныеЗначения.Значение КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.гф_ГлобальныеЗначения КАК гф_ГлобальныеЗначения
		|ГДЕ
		|	гф_ГлобальныеЗначения.Ключ = &Ключ"; 
		
		Ключ = "гф_ГлобальныеЗначенияДатаЦенДляПредоплатныхКлиентов";
		
		Запрос.Параметры.Вставить("Ключ", Ключ);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда  
			
			ДатаЦенОбъект = ПланыВидовХарактеристик.гф_ГлобальныеЗначения.СоздатьЭлемент();
			
			КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
			ТипДата = Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты);
			
			ДатаЦенОбъект.Ключ			= Ключ;
			ДатаЦенОбъект.Наименование	= "Дата цен для предоплатных клиентов";
			ДатаЦенОбъект.ТипЗначения	= ТипДата;
			ДатаЦенОбъект.Родитель		= ПланыВидовХарактеристик.гф_ГлобальныеЗначения.ОбщегоНазначения;
			
			ДатаЦенОбъект.Записать();
			
			ДатаЦен = Неопределено;
			
		Иначе
			
			Выборка = Результат.Выбрать();  
			
			Выборка.Следующий();
			
			ДатаЦен = Выборка.Значение;
			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ДатаЦен) Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено глобальное значение ""Дата цен для предоплатных клиентов"".");
			
		КонецЕсли;	
		
	Иначе	
		
		ДатаЦен = ТекущаяДатаСеанса();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоплатныйКлиентПриИзменении(Элемент)
	
	ПредоплатныйКлиентПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)   
	
	Если Не ЗначениеЗаполнено(ПрайсЛист) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для печати необходимо заполнить Прайс-лист");
		
		Возврат;			
		
	КонецЕсли;	
	
	ПараметрыПечати = Новый Структура("ДатаЦен, ПрайсЛист, ПредоплатныйКлиент, СкидкаКлиента");
	
	ЗаполнитьЗначенияСвойств(ПараметрыПечати, ЭтотОбъект);
	
	Закрыть(ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти
